'''
7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
При вызове функции должен создаваться объект-генератор.
Функция должна вызываться следующим образом: for el in fibo_gen().
 Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
'''
from itertools import count
from math import factorial

#блок делания
def fibo_gen():
    for el in count():  # а никто не говорил что не должно быть 0!
        yield factorial(el)

i = 0
for el in fibo_gen():
    if i < 15:
        print(f" факториал {i}: {el}")
        i +=1
    else:
        break
