'''Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
'''
my_list = [7, 5, 3, 3, 2]


while True:
    n = input("Введите натуральное число. Для того что бы закончить Введите 0\n")
    if n.isdigit():
        n = int(n)
        if n == 0:
            break
        else:
            my_list.append(n)
            print(sorted(my_list, reverse=True))
    else:
        print("Надо цифрой, а не букавками : ")
# думаю логично вывести список после завершения его создания
print(sorted(my_list, reverse=True))
