"""
2. Реализовать функцию, принимающую несколько параметров,
описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.

Функция должна принимать параметры как именованные аргументы.
Реализовать вывод данных о пользователе одной строкой.
"""

def my_func(name, surname, birth_yea, city, email, phone):
    print("Данные о пользователе: ", name, surname, birth_yea, city, email, phone)

my_func(name= 'Царь', surname='Романов', birth_year=1596, city='Москва', email='email', phone='0232')

'''
не стал делать что бы самому это все надо было вбить.
'''